driver-tests/bpelse/blueprints/cmdLine/soa/bpel/BluePrint5/test/reserveAll/Expected_Output.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Body><ns1:reservationStatusOfAll xmlns:msgns="http://localhost/BluePrint5/Reservation" xmlns:ns1="http://ReservationSystem.org/xsd/reserve"><airlineStatus xmlns="http://ReservationSystem.org/xsd/reserve">true</airlineStatus><hotelStatus xmlns="http://ReservationSystem.org/xsd/reserve">true</hotelStatus><carStatus xmlns="http://ReservationSystem.org/xsd/reserve">true</carStatus></ns1:reservationStatusOfAll></SOAP-ENV:Body></SOAP-ENV:Envelope>