driver-tests/bpelse/blueprints/bp5/BluePrint5Application/test/reserveAll/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:res="http://ReservationSystem.org/xsd/reserve" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <res:reserve>
      <res:reservationID>0000098761</res:reservationID>
      <res:description>book_car, book_hotel, book_airline</res:description>
    </res:reserve>
  </soapenv:Body>
</soapenv:Envelope>