driver-tests/bpelse/blueprints/bp5/BluePrint5Application/test/results/reserveAirline/Actual_20130326134418_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <reservationStatusOfAll xmlns="http://ReservationSystem.org/xsd/reserve" xmlns:msgns="http://localhost/BluePrint5/Reservation">
      <airlineStatus>true</airlineStatus>
      <hotelStatus>false</hotelStatus>
      <carStatus>false</carStatus>
    </reservationStatusOfAll>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>